---
kind: method
id: M:Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection.ChangeSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
source: html/da7980c5-a646-9ff4-279b-48cd9d5c8736.htm
---
# Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection.ChangeSection Method

The method that will be called when user wants to change beam section

## Syntax (C#)
```csharp
bool ChangeSection(
	Document doc,
	ElementId idElem
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`) - Revit document
- **idElem** (`Autodesk.Revit.DB.ElementId`) - id of the selected element

## Returns
Indicates whether the operation succeeded or not